tests/integration/bajaj/test_data/CDMS.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://local.bajaj.gladminds.co:8000/api/v1/feed/">
  <SOAP-ENV:Body>
    <ns1:postCreditNote>
      <ns1:ObjectList>
        <ns1:CreditNoteData>
            <ns1:CreditNoteModel>
              <ns1:GCP_KMS>444</ns1:GCP_KMS>
              <ns1:CDMS_DOC_NO>2</ns1:CDMS_DOC_NO>
              <ns1:GCP_UCN_NO>USC0077</ns1:GCP_UCN_NO>
              <ns1:CHASSIS>12345678901234577</ns1:CHASSIS>
              <ns1:SER_AVL_DT>2014-12-12</ns1:SER_AVL_DT>
              <ns1:CDMS_DT>2014-12-12</ns1:CDMS_DT>
              <ns1:SERVICE_TYPE>1</ns1:SERVICE_TYPE>
              <ns1:GCPDATA_RECV_DT>2014-12-12</ns1:GCPDATA_RECV_DT>
              <ns1:GCP_KUNNR>HIDealer002</ns1:GCP_KUNNR>
            </ns1:CreditNoteModel>
        </ns1:CreditNoteData>
      </ns1:ObjectList>
      <ns1:Credential>
        <ns1:UserName>bajaj</ns1:UserName>
        <ns1:Password>bajaj</ns1:Password>
      </ns1:Credential>
    </ns1:postCreditNote>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>